#include <stdio.h>
    
int main()
{
    /*Задайте стойности на променливите:
    char feeling[25] ;
    char who[25] ;
    char what [25] ;
    И отпечатайте изречение на екран в последователност „Who feeling what“
    printf("%s %s %s!", who, feeling,what);*/
    
    char feeling[5] = "love ";
    char who[2] = "I ";
    char what[12] = "programming!";
    
    printf("%s", who);
    
    return 0;
    
}
