#include <stdio.h>
#include <string.h>
 
int main()
{
   /*Правите програма за фитнес упражнения и давате опция на трениращия да
избере каква е целта на тренировката му, като съобразно с това му давате
инструкции:
1. Сила - "Прави упражненията с максималната тежест, на която си способен и 6
повторения!";
2. Издръжливост - "Прави упражненията с малка тежест 5-10 кг и 20
повторения!";
3. Тонус - "Прави упражненията с умерена тежест до 20 кг и 15 повторения!";
Разпишете if else if конструкцията.*/
 
    char typeOfProgram[20];
    char choiceOne[20] = "Сила";
    char choiceTwo[30] = "Издръжливост";
    char choiceThree[30] = "Тонус";
    
    printf("Добре дошли в програмата за фитнес упражнения\nИмате следните опции:\n");
    printf("1. Сила;\n2. Издръжливост;\n3. Тонус;\nНаправете своят избор:\n");
    scanf("%s", typeOfProgram);
    
    if(strcmp (typeOfProgram, choiceOne) == 0) {
        printf("Прави упражненията с максималната тежест, на която си способен и 6 повторения!");
    }
    else if(strcmp (typeOfProgram, choiceTwo) == 0) {
        printf("Прави упражненията с малка тежест 5-10 кг и 20 повторения!");
    }
    else if(strcmp (typeOfProgram, choiceThree) == 0) {
        printf("Прави упражненията с умерена тежест до 20 кг и 15 повторения!");
    }
    else {
        printf("Няма такава опция. Моля, уверете се, че изписвате правилно името на избраната опция.");
    }
    
    return 0;
}
